In [5]:
import pandas as pd
import numpy as np
from pathlib import Path

path_str = r"C:\Users\user\Desktop\div\data\world_population.csv"
csv_path = Path(path_str)
df = pd.read_csv(csv_path)
df2 = df.set_index('CCA3')
df2.head(3)

,Rank,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
CCA3,,,,,,,,,,,,,,,,
AFG,36,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52
ALB,138,Albania,Tirana,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04
DZA,34,Algeria,Algiers,Africa,44903225.0,43451666.0,39543154.0,35856344.0,30774621.0,25518074.0,18739378.0,13795915.0,2381741.0,18.8531,1.0164,0.56

In [13]:
df_pop = df2.loc['AFG':'AZE', ['Country', '2022 Population']]
df_area = df2.iloc[10:20, [1,-4]]
df_area

         Country  Area (km²)
CCA3
ABW        Aruba       180.0
AUS    Australia   7692024.0
AUT      Austria     83871.0
AZE   Azerbaijan     86600.0
BHS      Bahamas     13943.0
BHR      Bahrain       765.0
BGD   Bangladesh    147570.0
BRB     Barbados       430.0
BLR      Belarus    207600.0
BEL      Belgium     30528.0

In [26]:
adamlar = ['shahriyar', 'nijat', 'murad', 'asgar', 'aynur']
yemekler = ['dolma', 'katlet', 'ash', 'lule', 'bughlama']
rengler = ['cyan', 'qara', 'yashil', 'sari', 'goy']

s_yemek = pd.Series(yemekler, index=adamlar, name='yemek')
s_reng = pd.Series(rengler, index=adamlar, name='reng')
s_yemek

shahriyar       dolma
nijat          katlet
murad             ash
asgar            lule
aynur        bughlama
Name: yemek, dtype: object

In [33]:
pd.concat(
    [s_yemek, s_reng], 
    ignore_index=True, 
    axis='columns'
)

                  0       1
shahriyar     dolma    cyan
nijat        katlet    qara
murad           ash  yashil
asgar          lule    sari
aynur      bughlama     goy

In [38]:
pd.concat(
	[df_pop, df_area],
    axis='columns',
    keys=['pop', 'area']
).head(4)

                 pop                    area
             Country 2022 Population Country Area (km²)
CCA3
AFG      Afghanistan      41128771.0     NaN        NaN
ALB          Albania       2842321.0     NaN        NaN
DZA          Algeria      44903225.0     NaN        NaN
ASM   American Samoa         44273.0     NaN        NaN

In [73]:
yemekler = ['dolma', 'katlet', 'ash', 'lule', 'xengel']
adamlar_y = ['shahriyar', 'nijat', 'murad', 'asgar', 'isa']

rengler = ['cyan', 'qara', 'yashil', 'sari']
adamlar_r = ['shahriyar', 'nijat', 'murad', 'aynur']

s_yemek = pd.Series(yemekler, index=adamlar_y, name='yemek')
s_reng = pd.Series(rengler, index=adamlar_r, name='reng')
s_yemek

shahriyar     dolma
nijat        katlet
murad           ash
asgar          lule
isa          xengel
Name: yemek, dtype: object

In [74]:
s_reng

shahriyar      cyan
nijat          qara
murad        yashil
aynur          sari
Name: reng, dtype: object

In [79]:
pd.merge(s_yemek, s_reng, how='inner', left_index=True, right_index=True)

            yemek    reng
shahriyar   dolma    cyan
nijat      katlet    qara
murad         ash  yashil

In [53]:
df_area.head(3)

        Country  Area (km²)
CCA3
ABW       Aruba       180.0
AUS   Australia   7692024.0
AUT     Austria     83871.0

In [54]:
df_pop.head(3)

          Country  2022 Population
CCA3
AFG   Afghanistan       41128771.0
ALB       Albania        2842321.0
DZA       Algeria       44903225.0

In [62]:
df_pop.drop('Country', axis='columns').head()

      2022 Population
CCA3
AFG        41128771.0
ALB         2842321.0
DZA        44903225.0
ASM           44273.0
AND           79824.0

In [64]:
pd.merge(
    df_pop, 
    df_area.drop('Country', axis='columns'), 
    how='inner', 
    left_index=True, 
    right_index=True,
    # suffixes=['_pop', '_area'],
    )

         Country  2022 Population  Area (km²)
CCA3
ABW        Aruba         106445.0       180.0
AUS    Australia       26177413.0   7692024.0
AUT      Austria        8939617.0     83871.0
AZE   Azerbaijan       10358074.0     86600.0

In [71]:
pd.merge(
    df_pop,df_area,
    how='outer',
    left_on='Country',
    right_on='Country',
    # on='Country'
)

                Country  2022 Population  Area (km²)
0           Afghanistan       41128771.0         NaN
1               Albania        2842321.0         NaN
2               Algeria       44903225.0         NaN
3        American Samoa          44273.0         NaN
4               Andorra          79824.0         NaN
5                Angola       35588987.0         NaN
6              Anguilla          15857.0         NaN
7   Antigua and Barbuda          93763.0         NaN
8             Argentina       45510318.0         NaN
9               Armenia        2780469.0         NaN
10                Aruba         106445.0       180.0
11            Australia       26177413.0   7692024.0
12              Austria        8939617.0     83871.0
13           Azerbaijan       10358074.0     86600.0
14              Bahamas              NaN     13943.0
15              Bahrain              NaN       765.0
16           Bangladesh              NaN    147570.0
17             Barbados              NaN       430.0
18              Belarus              NaN    207600.0
19              Belgium              NaN     30528.0

In [ ]:
df_pop.cou

         Country  Area (km²)
CCA3
ABW        Aruba       180.0
AUS    Australia   7692024.0
AUT      Austria     83871.0
AZE   Azerbaijan     86600.0
BHS      Bahamas     13943.0
BHR      Bahrain       765.0
BGD   Bangladesh    147570.0
BRB     Barbados       430.0
BLR      Belarus    207600.0
BEL      Belgium     30528.0

In [80]:
pd.merge(s_yemek.reset_index(), s_reng.reset_index(), how='cross')

      index_x   yemek    index_y    reng
0   shahriyar   dolma  shahriyar    cyan
1   shahriyar   dolma      nijat    qara
2   shahriyar   dolma      murad  yashil
3   shahriyar   dolma      aynur    sari
4       nijat  katlet  shahriyar    cyan
5       nijat  katlet      nijat    qara
6       nijat  katlet      murad  yashil
7       nijat  katlet      aynur    sari
8       murad     ash  shahriyar    cyan
9       murad     ash      nijat    qara
10      murad     ash      murad  yashil
11      murad     ash      aynur    sari
12      asgar    lule  shahriyar    cyan
13      asgar    lule      nijat    qara
14      asgar    lule      murad  yashil
15      asgar    lule      aynur    sari
16        isa  xengel  shahriyar    cyan
17        isa  xengel      nijat    qara
18        isa  xengel      murad  yashil
19        isa  xengel      aynur    sari

In [203]:
['A', 'B', 'C'] * 2

['A', 'B', 'C', 'A', 'B', 'C']

In [208]:
rng = np.random.RandomState(0)
data2 = rng.randint(0,10,6)
data1 = np.arange(6)

df = pd.DataFrame({
    's' : ['A', 'B', 'C'] * 2,
    'data1' : data1,
    'data2' : data2,
})
df

   s  data1  data2
0  A      0      5
1  B      1      0
2  C      2      3
3  A      3      3
4  B      4      7
5  C      5      9

In [216]:
df.groupby('s').min()

   data1  data2
s
A      0      3
B      1      0
C      2      3

In [219]:
df2.head(3)

,Rank,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
CCA3,,,,,,,,,,,,,,,,
AFG,36,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52
ALB,138,Albania,Tirana,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04
DZA,34,Algeria,Algiers,Africa,44903225.0,43451666.0,39543154.0,35856344.0,30774621.0,25518074.0,18739378.0,13795915.0,2381741.0,18.8531,1.0164,0.56

In [221]:
df2.groupby('Continent')['Area (km²)'].min()

Continent
Africa             374.0
Asia                30.0
Europe               1.0
North America       21.0
Oceania             12.0
South America    12173.0
Name: Area (km²), dtype: float64

In [223]:
for g_name, d in df2.groupby('Continent'):
    print(g_name, d.shape, d['2022 Population'].mean())

Africa (57, 16) 25455879.67857143
Asia (50, 16) 96327387.30612245
Europe (50, 16) 15055371.81632653
North America (40, 16) 15007403.4
Oceania (23, 16) 2046386.3181818181
South America (14, 16) 31201186.285714287

In [228]:
df3 = df2.loc[:, "Continent":]
df3.head(3)

,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
CCA3,,,,,,,,,,,,,
AFG,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52
ALB,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04
DZA,Africa,44903225.0,43451666.0,39543154.0,35856344.0,30774621.0,25518074.0,18739378.0,13795915.0,2381741.0,18.8531,1.0164,0.56

In [230]:
df3.describe()

,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
count,2.300000e+02,2.330000e+02,2.300000e+02,2.270000e+02,2.270000e+02,2.290000e+02,2.290000e+02,2.300000e+02,2.320000e+02,230.000000,232.000000,234.000000
mean,3.463225e+07,3.360071e+07,3.206600e+07,3.027016e+07,2.684050e+07,1.933046e+07,1.628288e+07,1.586650e+07,5.816637e+05,456.811652,1.009553,0.427051
std,1.378892e+08,1.358732e+08,1.315071e+08,1.260742e+08,1.133525e+08,8.130962e+07,6.934547e+07,6.835586e+07,1.769133e+06,2083.740364,0.013390,1.714977
min,5.100000e+02,5.200000e+02,5.640000e+02,5.960000e+02,6.510000e+02,7.000000e+02,7.330000e+02,7.520000e+02,1.000000e+00,0.026100,0.912000,0.000000
25%,4.197385e+05,4.064710e+05,3.942950e+05,3.827265e+05,3.294700e+05,2.619280e+05,2.237520e+05,1.458805e+05,2.567250e+03,36.598125,1.001925,0.010000
50%,5.762857e+06,5.456681e+06,5.244415e+06,4.889741e+06,4.491202e+06,3.785847e+06,3.135123e+06,2.511718e+06,7.714100e+04,95.346750,1.007900,0.070000
75%,2.265372e+07,2.152263e+07,1.973085e+07,1.682585e+07,1.562547e+07,1.188276e+07,9.817257e+06,8.817329e+06,4.146432e+05,236.884000,1.016650,0.280000
max,1.425887e+09,1.424930e+09,1.393715e+09,1.348191e+09,1.264099e+09,1.153704e+09,9.823725e+08,8.225344e+08,1.709824e+07,23172.266700,1.069100,17.880000

In [242]:
df3.groupby('Continent')['2022 Population'].mean()
df3.groupby('Continent').agg({
    '2022 Population':'mean',
    '2020 Population':'sum',
}).rename({'2022 Population':'pop_2022'}, axis='columns')
# df3.groupby('Continent').agg(
#     pop_2022 = ('2022 Population', 'mean')
# )

                   pop_2022  2020 Population
Continent
Africa         2.545588e+07     1.360672e+09
Asia           9.632739e+07     4.652802e+09
Europe         1.505537e+07     7.457922e+08
North America  1.500740e+07     5.942366e+08
Oceania        2.046386e+06     4.393343e+07
South America  3.120119e+07     4.315300e+08